<?php
// From http://www.richyli.com/name/index.asp
$names = explode("、", "賴怡英、胡博秋、林家茹、蔡素貞、高依年、林芳孜、李思慈、張皇歡、李靜菱、邱香易、唐和吟、林雅伸、林欣筠、程祐玉、劉家意、劉彥君、陳玉昆、雲珮瑜、林于婷、謝宇軒、郭秋靖、張世彬、陳宣蘋、姚靖雯、梁惠禎、張凱亦、蔡玉玲、陳秉勳、李士哲、藍呈信、孫勇志、章健隆、趙聖傑、張乃杰、林韻婷、陳俊宇、黃靜義、郭佳樺、王世昌、趙茂清、黃鈺達、李旭鑫、劉淑仲、陳婉婷、柳培彥、林蓉蓁、馬吉裕、謝宗香、賴浩琦、林家侑、張明娟、劉祐亮、陳建恩、葉欣瑜、陳常倩、杜書豪、廉志文、林志明、柳裕盛、李易苓、林水善、吳璇翰、張景翔、馬哲宇、毛科海、楊婕妤、韓怡璇、林凱輝、蔡明明、許志翔、李依怡、邱木傑、蔡家榮、邱威廷、盧妙添、賴凱倫、夏俊佑、張怡臻、陳怡蓁、李耀德、陳曜宇、張雅婷、何寧宏、陳婉傑、黃舒婷、陳佩玲、林育雨、彭文豪、郭易來、劉秋萍、宋玉婷、盧國孝、黃育傑、彭麗芬、朱尹舜、黃合江、李美中、傅安琪、楊小旭、陳政憲");

$grades = array(
    "國語", "數學", "自然", "社會", "健康教育",
);

$jsons = array();
foreach ($names as $name) {
    $json = new StdClass;
    $json->name = $name;
    $json->grades = new StdClass;
    foreach ($grades as $grade) {
        $json->grades->{$grade} = rand(50, 100);
    }
    $jsons[] = $json;
}
echo json_encode($jsons, JSON_UNESCAPED_UNICODE);
